georgik/esp-idf-component-SDL/sdl/examples/bubble/sdkconfig.defaults.esp32_s3_korvo_2
# ESP32-S3 Korvo-2 Board Configuration Defaults
# Audio development board with dual microphones, LCD, camera, microSD

# Board selection
CONFIG_ESP_BSP_SDL_BOARD_ESP32_S3_KORVO_2=y
CONFIG_ESP_BSP_SDL_BOARD_NAME="ESP32-S3 Korvo-2"

# Target and basic configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32000

# Memory Configuration - PSRAM support
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Heap allocation preferences (prefer PSRAM for large allocations)
CONFIG_HEAP_ALLOCATION_POLICY_DEFAULT=1

# PSRAM optimizations for OCTAL mode
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_SPEED_80M=y

# Performance optimizations with OCTAL PSRAM
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3

# Display-specific optimizations
CONFIG_LCD_DRAW_BUFF_SIZE=12288

# Audio features (primary focus of this board)
CONFIG_AUDIO_CODEC_ENABLED=y
CONFIG_AUDIO_AMPLIFIER_ENABLED=y
CONFIG_DUAL_MICROPHONE_ARRAY=y
CONFIG_VOICE_RECOGNITION_ENABLED=y
CONFIG_NEAR_FAR_FIELD_WAKEUP=y

# Camera support
CONFIG_CAMERA_ENABLED=y

# JPEG video stream processing
CONFIG_JPEG_PROCESSING_ENABLED=y

# microSD card support
CONFIG_MICROSD_CARD_ENABLED=y

# Network audio/video optimization
CONFIG_NETWORK_AV_OPTIMIZED=y